<template>
  <div class="feedbackForm">

    <div class="left">
      <h1>
        <span>Если у вас есть</span> вопросы
        <span>или вы хотели бы</span> заказать
        услуги <span>в нашей компании, заполните</span> форму
      </h1>

      <form action="">
        <input type="text"
               placeholder="Ваше имя"
               name="name"
               id="name">

        <input type="tel"
               placeholder="+7 (978) 087 76 76"
               name="name"
               id="name">

        <input type="email"
               placeholder="E-mail"
               name="name"
               id="name">

        <textarea placeholder="Комментарий"/>

        <button type="submit">ОТПРАВИТЬ</button>

        <p>
          Нажимая на кнопку «Оставить заявку» вы соглашаетесь с политикой обработки
          персональных данных
        </p>
      </form>


    </div>

    <div class="right">
      <h2>+7(950) 676-76-81</h2>

      <div class="card">
        <svg width="33" height="33" viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M6.875 11.7076C6.875 6.76046 11.1843 2.75 16.5 2.75C21.8157 2.75 26.125 6.76046 26.125 11.7076C26.125 16.616 23.053 22.3437 18.2601 24.3919C17.1428 24.8694 15.8572 24.8694 14.7399 24.3919C9.94697 22.3437 6.875 16.616 6.875 11.7076Z" stroke="#00A0E3" stroke-width="2"/>
          <path d="M19.25 12.375C19.25 13.8938 18.0188 15.125 16.5 15.125C14.9812 15.125 13.75 13.8938 13.75 12.375C13.75 10.8562 14.9812 9.625 16.5 9.625C18.0188 9.625 19.25 10.8562 19.25 12.375Z" stroke="#00A0E3" stroke-width="2"/>
          <path d="M28.8207 21.3125C29.7356 22.1409 30.25 23.0747 30.25 24.0625C30.25 27.4798 24.0939 30.25 16.5 30.25C8.90608 30.25 2.75 27.4798 2.75 24.0625C2.75 23.0747 3.26441 22.1409 4.17927 21.3125" stroke="#00A0E3" stroke-width="2" stroke-linecap="round"/>
        </svg>

        <p>
          238300, Калининградская область, г. Гурьевск, ул.
          <br/>
          Луговая д. 2а/2 офис 8
        </p>
      </div>

      <div class="card">
        <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M2.6665 15.9999C2.6665 10.9716 2.6665 8.45745 4.2286 6.89535C5.7907 5.33325 8.30486 5.33325 13.3332 5.33325H18.6665C23.6948 5.33325 26.209 5.33325 27.7711 6.89535C29.3332 8.45745 29.3332 10.9716 29.3332 15.9999C29.3332 21.0282 29.3332 23.5424 27.7711 25.1045C26.209 26.6666 23.6948 26.6666 18.6665 26.6666H13.3332C8.30486 26.6666 5.7907 26.6666 4.2286 25.1045C2.6665 23.5424 2.6665 21.0282 2.6665 15.9999Z" stroke="#00A0E3" stroke-width="2"/>
          <path d="M8 10.6667L10.8785 13.0655C13.3274 15.1062 14.5518 16.1266 16 16.1266C17.4482 16.1266 18.6726 15.1062 21.1215 13.0655L24 10.6667" stroke="#00A0E3" stroke-width="2" stroke-linecap="round"/>
        </svg>


        <p>
          vadimyatskiy@xmail.ru
        </p>
      </div>

      <div class="card">
        <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <circle cx="15.9998" cy="16.0001" r="13.3333" stroke="#00A0E3" stroke-width="2"/>
          <path d="M16 10.6667V16.0001L19.3333 19.3334" stroke="#00A0E3" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>


        <p>
          Пн-Пт: 09:00 - 18:00
          <br/>
          Сб-Вс: Выходной
        </p>
      </div>

      <div class="bottom">
        <svg width="31" height="29" viewBox="0 0 31 29" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M3.13408 27.9455L4.83406 21.7522L4.91706 21.4498L4.76013 21.1783C3.56349 19.1082 2.93501 16.76 2.9379 14.3704L2.9379 14.3698C2.94105 6.86207 9.06566 0.750206 16.5938 0.75L3.13408 27.9455ZM3.13408 27.9455L9.51386 26.2762L9.80123 26.201L10.0622 26.3429C12.0561 27.4278 14.3017 28.0001 16.5877 28.0011C16.5878 28.0011 16.5879 28.0011 16.588 28.0011H16.594C24.121 28.0011 30.2469 21.888 30.2502 14.3807M3.13408 27.9455L16.5942 0.75C20.2494 0.751913 23.6755 2.1697 26.2548 4.74525C28.8342 7.32085 30.2515 10.7402 30.2502 14.3807M30.2502 14.3807L31.0002 14.381M30.2502 14.3807L31.0002 14.381M31.0002 14.381C30.9967 22.3039 24.5337 28.7511 16.594 28.7511H16.5877M31.0002 14.381C31.0016 10.5412 29.5049 6.93076 26.7847 4.21453L16.5877 28.7511M16.5877 28.7511C14.1769 28.7501 11.8079 28.1466 9.70371 27.0017L16.5877 28.7511Z" stroke="#2F2F2F" stroke-width="1.5"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M12.978 8.87419C12.7112 8.32521 12.4305 8.31409 12.1771 8.30459L11.4948 8.29688C11.2574 8.29688 10.8717 8.37937 10.5457 8.70937C10.2197 9.03937 9.2998 9.83692 9.2998 11.4591C9.2998 13.0813 10.5753 14.6488 10.7531 14.869C10.9308 15.0893 13.2154 18.5243 16.8334 19.8459C19.84 20.9442 20.4518 20.7258 21.1047 20.6709C21.7575 20.616 23.2106 19.8733 23.507 19.1034C23.8034 18.3335 23.8036 17.6738 23.7148 17.5359C23.6259 17.398 23.3885 17.316 23.0323 17.151C22.676 16.986 20.9264 16.1885 20.6001 16.0784C20.2739 15.9682 20.0367 15.9135 19.7992 16.2435C19.5616 16.5735 18.8803 17.3158 18.6725 17.5359C18.4648 17.756 18.2574 17.7836 17.9012 17.6188C17.5449 17.4539 16.3988 17.1056 15.0388 15.9824C13.9808 15.1084 13.2665 14.0291 13.0586 13.6993C12.8506 13.3695 13.0365 13.1909 13.215 13.0266C13.3747 12.8788 13.5709 12.6415 13.7492 12.4491C13.9275 12.2567 13.9862 12.1191 14.1047 11.8994C14.2232 11.6797 14.1641 11.4867 14.075 11.3219C13.986 11.1571 13.2944 9.52629 12.978 8.87419Z" fill="#2F2F2F"/>
        </svg>

        <svg width="41" height="33" viewBox="0 0 41 33" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M40 1L1 16.5L15.3684 18.5667M40 1L34.8684 32L15.3684 18.5667M40 1L15.3684 18.5667M15.3684 18.5667V29.9333L22.0374 23.1609" stroke="#2F2F2F" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>

        <svg width="56" height="33" viewBox="0 0 56 33" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M32.9154 31.7887V22.7147C39.0908 23.6439 41.0431 28.4406 44.9754 31.7887H55C52.4937 26.2663 48.7542 21.3749 44.0615 17.4807C47.6615 12.5885 51.4831 7.98314 53.3523 1H44.2415C40.6692 6.34326 38.7862 12.6021 32.9154 16.7291V1H19.6923L22.8492 4.85371V18.5877C17.7262 18 14.2646 8.74841 10.5123 1H1C4.46154 11.4679 11.7446 34.4398 32.9154 31.7887Z" stroke="#2B2A29" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>
      </div>

      <div class="map">

      </div>
    </div>
  </div>
</template>
<script setup>

</script>
<style scoped lang="scss">
.feedbackForm {
  display: flex;
  justify-content: space-between;
  flex-wrap: wrap;

  .left {
    text-align: left;
    max-width: 700px;

    h1 {
      font-size: 48px;

      @media (max-width: 700px) {
        font-size: 24px;
      }

      span {
        color: #A2A0A0;
      }
    }

    form {
      display: flex;
      flex-direction: column;
      gap: 10px;

      @media (max-width: 700px) {
        font-size: 11px;
      }

      input {
        padding: 24px 20px;
      }

      textarea {
        padding: 24px 20px;
      }

      button {
        width: 109px;
        margin-top: 20px;
      }
    }
  }

  .right {
    display: flex;
    flex-direction: column;
    align-items: flex-start;
    padding-right: 60px;
    text-align: left;

    h2 {
      font-weight: 600;
      font-size: 48px;
      color: #A2A0A0;
      width: 100%;
    }

    .card {
      display: flex;
      align-items: center;
      gap: 20px;
      margin-bottom: 14px;
      line-height: 1.8;
    }

    .bottom {
      display: flex;
      justify-content: center;
      gap: 20px;
    }
  }
}
</style>
