<template>
  <div class="container-fluid" style="background-color: white; padding: 0;margin: 0;">
    <div class="feeedForm">
      <div class="content container-xxl">
        <div :class="`${animated ? 'animated animatedFadeInUp fadeInUp' : false} top`" :style="`display: ${animated ? 'grid' : `none`}`">
          <h2>
            ЧТО ЕЩЁ ВЫ ПОЛУЧИТЕ РАБОТАЯ С НАМИ?
          </h2>
          <p>
            Свои поставки химии и оборудования для очистки промышленной и питьевой воды с 2007 года и своя складская программа.
            Поставляем напрямую из Китая, Индии и России.
            Поставили сотни работающих систем от Санкт-Петербурга до Барнаула.
          </p>
        </div>

        <div :class="`${animatedBottom ? 'animated animatedFadeInUp fadeInUp' : false} middle`" :style="`display: ${animatedBottom ? 'grid' : `none`}`">
          <div :class="`${animated ? 'animated animatedFadeInUp fadeInUp' : false} card`">
            <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M22.3896 8.55455C23.4451 6.661 23.9729 5.71423 24.7619 5.71423C25.551 5.71423 26.0787 6.661 27.1343 8.55454L27.4074 9.04443C27.7073 9.58251 27.8573 9.85155 28.0911 10.0291C28.325 10.2066 28.6162 10.2725 29.1987 10.4043L29.729 10.5243C31.7787 10.988 32.8036 11.2199 33.0474 12.004C33.2912 12.7881 32.5925 13.6051 31.1952 15.2392L30.8337 15.6619C30.4366 16.1263 30.238 16.3584 30.1487 16.6457C30.0594 16.9329 30.0894 17.2427 30.1494 17.8622L30.2041 18.4262C30.4154 20.6064 30.521 21.6965 29.8826 22.1811C29.2443 22.6657 28.2847 22.2239 26.3655 21.3402L25.869 21.1116C25.3237 20.8605 25.051 20.7349 24.7619 20.7349C24.4729 20.7349 24.2002 20.8605 23.6548 21.1116L23.1583 21.3402C21.2392 22.2239 20.2796 22.6657 19.6412 22.1811C19.0029 21.6965 19.1085 20.6064 19.3198 18.4262L19.3744 17.8622C19.4344 17.2427 19.4645 16.9329 19.3751 16.6457C19.2858 16.3584 19.0873 16.1263 18.6902 15.6619L18.3287 15.2392C16.9313 13.6051 16.2326 12.7881 16.4764 12.004C16.7203 11.2199 17.7451 10.988 19.7949 10.5243L20.3252 10.4043C20.9076 10.2725 21.1989 10.2066 21.4327 10.0291C21.6666 9.85155 21.8165 9.58251 22.1165 9.04443L22.3896 8.55455Z" stroke="#1472D0" stroke-width="3"/>
              <path d="M40.4805 16.0035C41.0083 15.0568 41.2721 14.5834 41.6667 14.5834C42.0612 14.5834 42.3251 15.0568 42.8528 16.0035L42.9894 16.2485C43.1394 16.5175 43.2144 16.652 43.3313 16.7408C43.4482 16.8296 43.5938 16.8625 43.885 16.9284L44.1502 16.9884C45.1751 17.2203 45.6875 17.3362 45.8094 17.7283C45.9313 18.1203 45.582 18.5288 44.8833 19.3458L44.7025 19.5572C44.504 19.7894 44.4047 19.9055 44.3601 20.0491C44.3154 20.1927 44.3304 20.3476 44.3604 20.6574L44.3878 20.9394C44.4934 22.0295 44.5462 22.5745 44.227 22.8168C43.9078 23.0591 43.4281 22.8382 42.4685 22.3964L42.2202 22.2821C41.9475 22.1565 41.8112 22.0937 41.6667 22.0937C41.5221 22.0937 41.3858 22.1565 41.1131 22.2821L40.8649 22.3964C39.9053 22.8382 39.4255 23.0591 39.1063 22.8168C38.7871 22.5745 38.8399 22.0295 38.9456 20.9394L38.9729 20.6574C39.0029 20.3476 39.0179 20.1927 38.9733 20.0491C38.9286 19.9055 38.8293 19.7894 38.6308 19.5572L38.45 19.3458C37.7514 18.5288 37.402 18.1203 37.5239 17.7283C37.6458 17.3362 38.1583 17.2203 39.1831 16.9884L39.4483 16.9284C39.7395 16.8625 39.8851 16.8296 40.0021 16.7408C40.119 16.652 40.194 16.5175 40.3439 16.2485L40.4805 16.0035Z" stroke="#1472D0" stroke-width="3"/>
              <path d="M7.14711 16.0035C7.67488 15.0568 7.93877 14.5834 8.33329 14.5834C8.72782 14.5834 8.9917 15.0568 9.51947 16.0035L9.65601 16.2485C9.80599 16.5175 9.88098 16.652 9.9979 16.7408C10.1148 16.8296 10.2604 16.8625 10.5517 16.9284L10.8168 16.9884C11.8417 17.2203 12.3541 17.3362 12.476 17.7283C12.5979 18.1203 12.2486 18.5288 11.5499 19.3458L11.3692 19.5572C11.1706 19.7894 11.0713 19.9055 11.0267 20.0491C10.982 20.1927 10.997 20.3476 11.027 20.6574L11.0544 20.9394C11.16 22.0295 11.2128 22.5745 10.8936 22.8168C10.5745 23.0591 10.0947 22.8382 9.13509 22.3964L8.88684 22.2821C8.61416 22.1565 8.47781 22.0937 8.33329 22.0937C8.18877 22.0937 8.05243 22.1565 7.77974 22.2821L7.53149 22.3964C6.57191 22.8382 6.09212 23.0591 5.77294 22.8168C5.45376 22.5745 5.50658 22.0295 5.61221 20.9394L5.63954 20.6574C5.66955 20.3476 5.68456 20.1927 5.6399 20.0491C5.59524 19.9055 5.49597 19.7894 5.29743 19.5572L5.11667 19.3458C4.41798 18.5288 4.06864 18.1203 4.19055 17.7283C4.31247 17.3362 4.8249 17.2203 5.84977 16.9884L6.11491 16.9284C6.40615 16.8625 6.55176 16.8296 6.66869 16.7408C6.78561 16.652 6.86059 16.5175 7.01057 16.2485L7.14711 16.0035Z" stroke="#1472D0" stroke-width="3"/>
              <path d="M10.4166 42.4758H15.1248C17.2308 42.4758 19.3594 42.6952 21.409 43.1174C25.0345 43.8643 28.8517 43.9548 32.5144 43.3619C34.3204 43.0696 36.0959 42.6226 37.703 41.8469C39.1539 41.1466 40.9311 40.1596 42.1248 39.0539C43.3168 37.9499 44.5583 36.143 45.4394 34.7307C46.195 33.5196 45.8295 32.0337 44.6344 31.1313C43.3068 30.1289 41.3369 30.1291 40.0096 31.1317L36.2446 33.9759C34.7855 35.0781 33.1916 36.0928 31.2928 36.3956C31.0645 36.432 30.8253 36.4652 30.5757 36.4941M30.5757 36.4941C30.5006 36.5028 30.4245 36.5111 30.3475 36.519M30.5757 36.4941C30.8794 36.429 31.1811 36.2417 31.464 35.9947C32.804 34.8252 32.8888 32.8541 31.7261 31.5481C31.4563 31.2451 31.1407 30.9924 30.7897 30.7831C24.9619 27.3071 15.8946 29.9545 10.4166 33.8394M30.5757 36.4941C30.4997 36.5104 30.4235 36.519 30.3475 36.519M30.3475 36.519C29.2571 36.631 27.9815 36.6599 26.5661 36.5263" stroke="#1472D0" stroke-width="3" stroke-linecap="round"/>
              <rect x="4.16663" y="29.1666" width="6.25" height="16.6667" rx="1.5" stroke="#1472D0" stroke-width="3"/>
            </svg>

            <div class="divider"></div>
            <h3>ПРОВЕРЕННЫЕ БРЕНДЫ</h3>
            <p>Выбор основан на опыте поставок с 2007г.</p>
          </div>

          <div class="current card">
            <svg width="60" height="60" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg">
              <circle cx="30" cy="30" r="25" stroke="white" stroke-width="3"/>
              <path d="M22.5 35H30" stroke="white" stroke-width="3" stroke-linecap="round"/>
              <path d="M24.7857 29.6428V20.1428C24.7857 19.6783 24.7857 19.4461 24.8165 19.2517C24.9859 18.182 25.8249 17.343 26.8946 17.1736C27.089 17.1428 27.3212 17.1428 27.7857 17.1428H33.5357C36.9875 17.1428 39.7857 19.941 39.7857 23.3928C39.7857 26.8446 36.9875 29.6428 33.5357 29.6428H24.7857ZM24.7857 29.6428V42.1428M24.7857 29.6428H22.2857" stroke="white" stroke-width="3" stroke-linecap="round"/>
            </svg>

            <div class="divider"></div>
            <h3>ЦЕНЫ НИЖЕ РЫНОЧНЫХ</h3>
            <p>Прямые поставки без посредников</p>
          </div>

          <div :class="`${animatedBottom ? 'animated animatedFadeInUp fadeInUp' : false} card`">
            <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M8.33337 20.8334C8.33337 12.9766 8.33337 9.04824 10.7742 6.60746C13.2149 4.16669 17.1433 4.16669 25 4.16669C32.8568 4.16669 36.7852 4.16669 39.2259 6.60746C41.6667 9.04824 41.6667 12.9766 41.6667 20.8334V25C41.6667 32.8568 41.6667 36.7851 39.2259 39.2259C36.7852 41.6667 32.8568 41.6667 25 41.6667C17.1433 41.6667 13.2149 41.6667 10.7742 39.2259C8.33337 36.7851 8.33337 32.8568 8.33337 25V20.8334Z" stroke="#1472D0" stroke-width="3"/>
              <path d="M8.33337 27.0833H41.6667" stroke="#1472D0" stroke-width="3" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M32.2916 33.3333H35.4166" stroke="#1472D0" stroke-width="3" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M14.5834 33.3333H17.7084" stroke="#1472D0" stroke-width="3" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M12.5 40.625V43.75C12.5 44.9006 13.4327 45.8333 14.5833 45.8333H17.7083C18.8589 45.8333 19.7917 44.9006 19.7917 43.75V41.6667" stroke="#1472D0" stroke-width="3" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M37.5 40.625V43.75C37.5 44.9006 36.5673 45.8333 35.4167 45.8333H32.2917C31.1411 45.8333 30.2084 44.9006 30.2084 43.75V41.6667" stroke="#1472D0" stroke-width="3" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M41.6666 18.75H43.75C44.9006 18.75 45.8333 19.6827 45.8333 20.8333V22.9167C45.8333 23.5724 45.5246 24.1899 45 24.5833L41.6666 27.0833" stroke="#1472D0" stroke-width="3" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M8.33329 18.75H6.24996C5.09937 18.75 4.16663 19.6827 4.16663 20.8333V22.9167C4.16663 23.5724 4.47536 24.1899 4.99996 24.5833L8.33329 27.0833" stroke="#1472D0" stroke-width="3" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M40.625 10.4167H9.375" stroke="#1472D0" stroke-width="3" stroke-linecap="round"/>
            </svg>


            <div class="divider"></div>
            <h3>ОТГРУЗКА В ДЕНЬ ЗАЯВКИ</h3>
            <p>Отлаженная логистическая сеть</p>
          </div>

          <div class="card">
            <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M32.4535 7.04579L36.6202 9.23235C41.1028 11.5847 43.3441 12.7609 44.5887 14.8745C45.8333 16.988 45.8333 19.6181 45.8333 24.8782V25.1219C45.8333 30.382 45.8333 33.012 44.5887 35.1256C43.3441 37.2391 41.1028 38.4153 36.6202 40.7677L32.4535 42.9543C28.796 44.8737 26.9672 45.8334 25 45.8334C23.0327 45.8334 21.2039 44.8737 17.5464 42.9543L13.3797 40.7677C8.8971 38.4153 6.65578 37.2391 5.4112 35.1256C4.16663 33.012 4.16663 30.382 4.16663 25.1219V24.8782C4.16663 19.6181 4.16663 16.988 5.4112 14.8745C6.65578 12.7609 8.8971 11.5847 13.3797 9.23235L17.5464 7.04578C21.2039 5.12639 23.0327 4.16669 25 4.16669C26.9672 4.16669 28.796 5.12639 32.4535 7.04579Z" stroke="#1472D0" stroke-width="3" stroke-linecap="round"/>
              <path d="M43.75 15.625L35.4167 19.7917M25 25L6.25 15.625M25 25V44.7917M25 25C25 25 30.7138 22.1431 34.375 20.3125C34.7818 20.1091 35.4167 19.7917 35.4167 19.7917M35.4167 19.7917V27.0833M35.4167 19.7917L15.625 9.375" stroke="#1472D0" stroke-width="3" stroke-linecap="round"/>
            </svg>

            <div class="divider"></div>
            <h3 :class="`${animatedBottom ? 'animated animatedFadeInUp fadeInUp' : false}`">НАЛИЧИЕ</h3>
            <p>Вся продукция всегда на складе</p>
          </div>

          <div :class="`${animatedBottom ? 'animated animatedFadeInUp fadeInUp' : false} card`">
            <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M33.3333 45.8333C29.405 45.8333 27.4408 45.8333 26.2204 44.6129C25 43.3925 25 41.4284 25 37.5L25 12.5C25 8.57162 25 6.60743 26.2204 5.38705C27.4408 4.16666 29.405 4.16666 33.3333 4.16666L37.5 4.16666C41.4284 4.16666 43.3926 4.16666 44.6129 5.38705C45.8333 6.60743 45.8333 8.57162 45.8333 12.5V37.5C45.8333 41.4284 45.8333 43.3925 44.6129 44.6129C43.3926 45.8333 41.4284 45.8333 37.5 45.8333H33.3333Z" stroke="#1472D0" stroke-width="3"/>
              <path d="M25 25H29.1667M25 12.5L29.1667 12.5M25 37.5H29.1667M25 31.25L31.25 31.25M25 18.75L31.25 18.75" stroke="#1472D0" stroke-width="3" stroke-linecap="round"/>
              <path d="M4.16663 12.0833L4.16663 10.1042C4.16663 6.82497 6.96485 4.16666 10.4166 4.16666C13.8684 4.16666 16.6666 6.82497 16.6666 10.1042L16.6666 12.0833M4.16663 12.0833C4.16663 12.0833 6.51038 14.0625 10.4166 14.0625C14.3229 14.0625 16.6666 12.0833 16.6666 12.0833M4.16663 12.0833L4.16663 32.3621C4.16663 33.5945 4.16663 34.2107 4.24531 34.8154C4.33812 35.5287 4.51246 36.2303 4.76523 36.9077C4.97952 37.482 5.2696 38.0331 5.84976 39.1354L8.30817 43.8064M16.6666 12.0833L16.6666 32.3621C16.6666 33.5945 16.6666 34.2107 16.5879 34.8154C16.4951 35.5287 16.3208 36.2303 16.068 36.9077C15.8537 37.482 15.5637 38.0331 14.9835 39.1354L12.5251 43.8064M12.5251 43.8064L11.9241 44.9482C11.6386 45.4907 11.055 45.8333 10.4166 45.8333C9.77822 45.8333 9.19461 45.4907 8.90911 44.9482L8.30817 43.8064M12.5251 43.8064H8.30817" stroke="#1472D0" stroke-width="3"/>
            </svg>

            <div class="divider"></div>
            <h3>ОПТИМАЛЬНЫЙ КОМПЛЕКТ</h3>
            <p>Более 14-ти лет помогаем собирать системы очистки</p>
          </div>

          <div class="card">
            <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M14.5833 37.4964C10.052 37.4711 7.59801 37.2702 5.99721 35.6694C4.16663 33.8388 4.16663 30.8925 4.16663 25L4.16663 16.6667C4.16663 10.7741 4.16663 7.82782 5.99721 5.99724C7.82779 4.16666 10.7741 4.16666 16.6666 4.16666L33.3333 4.16666C39.2259 4.16666 42.1721 4.16666 44.0027 5.99724C45.8333 7.82782 45.8333 10.7741 45.8333 16.6667V25C45.8333 30.8925 45.8333 33.8388 44.0027 35.6694C42.4822 37.19 40.1918 37.4475 36.0826 37.4911L34.375 37.4964" stroke="#1472D0" stroke-width="3"/>
              <path d="M18.75 12.5L31.25 12.5" stroke="#1472D0" stroke-width="3" stroke-linecap="round"/>
              <path d="M14.5834 19.7917H35.4167" stroke="#1472D0" stroke-width="3" stroke-linecap="round"/>
              <path d="M22.6889 29.0529C24.0206 27.9179 25.9794 27.9179 27.3111 29.0529C27.8818 29.5392 28.5914 29.8331 29.3388 29.8928C31.083 30.0319 32.468 31.417 32.6072 33.1612C32.6669 33.9086 32.9608 34.6182 33.4471 35.1889C34.582 36.5206 34.582 38.4794 33.4471 39.8111C32.9608 40.3818 32.6669 41.0914 32.6072 41.8388C32.468 43.583 31.083 44.9681 29.3388 45.1072C28.5914 45.1669 27.8818 45.4608 27.3111 45.9471C25.9794 47.0821 24.0206 47.0821 22.6889 45.9471C22.1182 45.4608 21.4086 45.1669 20.6612 45.1072C18.917 44.9681 17.5319 43.583 17.3927 41.8388C17.3331 41.0914 17.0392 40.3818 16.5528 39.8111C15.4179 38.4794 15.4179 36.5206 16.5528 35.1889C17.0392 34.6182 17.3331 33.9086 17.3927 33.1612C17.5319 31.417 18.917 30.0319 20.6612 29.8928C21.4086 29.8331 22.1182 29.5392 22.6889 29.0529Z" stroke="#1472D0" stroke-width="3"/>
              <path d="M21.875 37.9167L23.6607 39.5833L28.125 35.4167" stroke="#1472D0" stroke-width="3" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>

            <div class="divider"></div>
            <h3>ГАРАНТИЯ</h3>
            <p>При заказе оборудования гарантия 1 год.</p>
          </div>
        </div>

        <div class="bottom">
          <h1 :class="`${animatedBottom ? 'animated animatedFadeInUp fadeInUp' : false}`">
            БЕСПЛАТНО ПОДБЕРЁМ ОБОРУДОВАНИЕ ДЛЯ ВАШЕГО ДОМА ИЛИ КВАРТИРЫ
          </h1>
          <button type="button" class="btn btn-light" style="color: rgba(20, 114, 208, 1); padding: 22px 42px; font-weight: 700;">ОСТАВИТЬ ЗАЯВКУ</button>
        </div>
      </div>
    </div>
  </div>
</template>
<script setup>
import {onMounted, ref} from "vue";

const animated = ref(false);
const animatedBottom = ref(false);

onMounted(() => {
  document.addEventListener(`scroll`, (e) => {
    const windowScroll = window.scrollY;
    if (windowScroll > 2900 ) {
      animated.value = true;
    }
    if (windowScroll > 3040 ) {
      animatedBottom.value = true;
    }

  })
})

</script>
<style scoped lang="scss">
.feeedForm {
  display: grid;
  gap: 30px;
  text-align: left;
  padding: 90px 30px 240px 30px;
  background-color: rgba(20, 114, 208, 1);
  border-radius: 80px;
  background-repeat: no-repeat;
  background-image: url("./../assets/slide/bgFeed.png");
  background-position: bottom center;
  //background-size: ;

  @media (max-width: 750px){
    padding: 55px 10px 0px 10px;
    border-radius: 20px;
    background-image: url("./../assets/slide/fon_mob.png");
    background-size: contain;
    background-position-y: 120%;
  }

  .content {

    .bottom {

      display: flex;
      flex-direction: column;
      align-items: center;
      max-width: 678px;
      margin: 166px auto;
      text-align: center;
      color: #FFFFFF;
      gap: 40px;

      h1 {
        font-size: 44px;
        font-weight: 700;
        line-height: 60px;

        @media (max-width: 1000px) {
          font-size: 24px;
          line-height: 32px;
        }
      }
    }

    .middle {
      display: grid;
      grid-template-columns: repeat(3, 1fr);
      gap: 20px;

      @media (max-width: 1200px) and (min-width: 520px){
        grid-template-columns: repeat(2, 1fr);
      }

      @media (max-width: 521px) {
        grid-template-columns: repeat(1, 1fr);
      }

      .card {
        padding: 40px 40px 65px 40px;
        border-radius: 30px;
        background-color: rgba(255, 255, 255, 1);
        display: flex;
        flex-direction: column;
        align-items: flex-start;

        @media (max-width: 1000px) {
          padding: 20px 20px 40px 20px;
        }

        h3 {
          font-size: 20px;
          font-weight: 700;
        }

        p {
          font-size: 14px;
        }

        .divider {
          height: 20px;
        }
      }

      .current {
        background: linear-gradient(120.99deg, #B4CDED 4.24%, #DBF1FF 95.76%);
        color: #FFFFFF;
      }
    }

    .top {
      display: grid;
      gap: 40px;

      h2 {
        font-size: 44px;
        font-weight: 700;
        max-width: 780px;
        color: #FFFFFF;

        @media (max-width: 1000px){
          font-size: 28px;
        }
      }

      p {
        line-height: 20px;
        color: white;
        max-width: 840px;
        @media (max-width: 1000px){
          font-size: 12px;
        }
      }
    }
  }
}
</style>